Revit 2027 API
Form.PathCurveReference Property
The curve reference in the path, specified by curve index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference this[
	int curveIndex
] { get; }
Public ReadOnly Property PathCurveReference (
	curveIndex As Integer
) As Reference
	Get
public:
property Reference^ PathCurveReference[int curveIndex] {
	Reference^ get (int curveIndex);
}
member PathCurveReference : Reference with get
Parameters
curveIndex Int32
Index to specify the curve in path
Property Value
Reference
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace